Duet3D/Duet3Expansion/src/atmel/SAM4S_DFP/1.0.56/sam4s/include/sam.h
/**
 * \file
 *
 * \brief Top level header file
 *
 * Copyright (c) 2016 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAM_
#define _SAM_

#if   defined(__SAM4S16B__) || defined(__ATSAM4S16B__)
  #include "sam4s16b.h"
#elif defined(__SAM4S16C__) || defined(__ATSAM4S16C__)
  #include "sam4s16c.h"
#elif defined(__SAM4S2A__) || defined(__ATSAM4S2A__)
  #include "sam4s2a.h"
#elif defined(__SAM4S2B__) || defined(__ATSAM4S2B__)
  #include "sam4s2b.h"
#elif defined(__SAM4S2C__) || defined(__ATSAM4S2C__)
  #include "sam4s2c.h"
#elif defined(__SAM4S4A__) || defined(__ATSAM4S4A__)
  #include "sam4s4a.h"
#elif defined(__SAM4S4B__) || defined(__ATSAM4S4B__)
  #include "sam4s4b.h"
#elif defined(__SAM4S4C__) || defined(__ATSAM4S4C__)
  #include "sam4s4c.h"
#elif defined(__SAM4S8B__) || defined(__ATSAM4S8B__)
  #include "sam4s8b.h"
#elif defined(__SAM4S8C__) || defined(__ATSAM4S8C__)
  #include "sam4s8c.h"
#elif defined(__SAM4SA16B__) || defined(__ATSAM4SA16B__)
  #include "sam4sa16b.h"
#elif defined(__SAM4SA16C__) || defined(__ATSAM4SA16C__)
  #include "sam4sa16c.h"
#elif defined(__SAM4SD16B__) || defined(__ATSAM4SD16B__)
  #include "sam4sd16b.h"
#elif defined(__SAM4SD16C__) || defined(__ATSAM4SD16C__)
  #include "sam4sd16c.h"
#elif defined(__SAM4SD32B__) || defined(__ATSAM4SD32B__)
  #include "sam4sd32b.h"
#elif defined(__SAM4SD32C__) || defined(__ATSAM4SD32C__)
  #include "sam4sd32c.h"
#else
  #error Library does not support the specified device
#endif

#endif /* _SAM_ */

